---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveIsReferenceLine
source: html/555ba1db-a510-b9d1-eb83-a39418320420.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveIsReferenceLine Property

"Is Reference Line"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveIsReferenceLine { get; }
```